tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "powershell/tap"
brew "xz"
brew "openssl@3"
brew "ascii"
brew "coreutils"
brew "asdf"
brew "sqlite"
brew "python@3.12"
brew "autojump"
brew "bash"
brew "bash-completion"
brew "bash-completion@2"
brew "bats-core"
brew "bdw-gc"
brew "black"
brew "icu4c"
brew "boost"
brew "c-ares"
brew "fontconfig"
brew "gettext"
brew "libxext"
brew "catimg"
brew "cava"
brew "ccache"
brew "chruby"
brew "clang-format"
brew "cmake"
brew "colordiff"
brew "cookiecutter"
brew "dart-sdk"
brew "dotenv-linter"
brew "doxygen"
brew "unbound"
brew "harfbuzz"
brew "libsodium"
brew "numpy"
brew "tbb"
brew "theora"
brew "fish"
brew "fisher"
brew "flavours"
brew "fontforge"
brew "gh"
brew "git"
brew "git-gui"
brew "git-interactive-rebase-tool"
brew "gnu-sed"
brew "gnu-time"
brew "go"
brew "grc"
brew "node"
brew "gulp-cli"
brew "htop"
brew "httrack"
brew "hugo"
brew "imagemagick"
brew "ipython"
brew "jp2a"
brew "jq"
brew "pandoc"
brew "jupyterlab"
brew "libgpg-error"
brew "lua"
brew "lmod"
brew "lolcat"
brew "lsd"
brew "ruby"
brew "macvim"
brew "mas"
brew "mercurial"
brew "mypy"
brew "zlib"
brew "neofetch"
brew "ninja"
brew "nox"
brew "nvm"
brew "openjdk"
brew "pdftk-java"
brew "pipx"
brew "poetry"
brew "pre-commit"
brew "pyenv"
brew "python-urllib3"
brew "python@3.11"
brew "qt"
brew "ruby-build"
brew "rbenv"
brew "rename"
brew "root"
brew "ruff"
brew "rust"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "subversion"
brew "swig"
brew "terminal-notifier"
brew "thefuck"
brew "tmux"
brew "tor"
brew "tox"
brew "tree"
brew "vcs"
brew "virtualenv"
brew "virtualenvwrapper"
brew "w3m"
brew "wget"
brew "yarn"
brew "zplug"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/sketchybar"
brew "powershell/tap/powershell"
cask "adobe-creative-cloud"
cask "alacritty"
cask "amethyst"
cask "balenaetcher"
cask "brave-browser"
cask "cakebrew"
cask "diffmerge"
cask "disk-drill"
cask "docker"
cask "dropbox"
cask "etrecheckpro"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-fira-sans"
cask "font-fira-sans-condensed"
cask "font-fira-sans-extra-condensed"
cask "font-firago"
cask "font-mononoki"
cask "fontforge"
cask "gimp"
cask "gulp"
cask "imazing"
cask "imazing-converter"
cask "imazing-profile-editor"
cask "ipvanish-vpn"
cask "iterm2"
cask "macdown"
cask "mactex"
cask "mattermost"
cask "megasync"
cask "miniconda"
cask "motrix"
cask "powershell"
cask "sf-symbols"
cask "spline"
cask "texstudio"
cask "tor-browser"
cask "warp"
cask "whatsapp"
cask "wireshark"
mas install 442397431 # Address Book Clearout
mas install 1451544217 # Adobe Lightroom
mas install 6447312365 # AI Chat Bot
mas install 1037126344 # Apple Configurator
mas install 1028905953 # Betternet VPN
mas install 1518425043 # Boop
mas install 6449970704 # Brand Identity - Stylescape
mas install 897446215 # Canva
mas install 1500855883 # CapCut
mas install 1456386228 # Clockology
mas install 1130254674 # CloudMounter
mas install 1516894961 # Codye
mas install 1531594277 # Color Widgets
mas install 6476814377 # com.xavyx.Easy-Face-Blur
mas install 595191960 # CopyClip
mas install 1487937127 # Craft
mas install 6476924627 # Create Custom Symbols
mas install 980888073 # Crypto Pro
mas install 640199958 # Developer
mas install 1588151344 # Essentials
mas install 923463607 # Faviconer
mas install 1462114288 # Grammarly for Safari
mas install 1460330618 # Hype 4
mas install 1487860882 # iMazing Profile Editor
mas install 408981434 # iMovie
mas install 409183694 # Keynote
mas install 1602158108 # Logo Maker
mas install 6445850897 # Logo Maker & Creator
mas install 1369145272 # Logo Maker - Design Monogram
mas install 1458866808 # MacFamilyTree 9
mas install 441258766 # Magnet
mas install 1480068668 # Messenger
mas install 462058435 # Microsoft Excel
mas install 784801555 # Microsoft OneNote
mas install 985367838 # Microsoft Outlook
mas install 462062816 # Microsoft PowerPoint
mas install 462054704 # Microsoft Word
mas install 1464222390 # Model Pro
mas install 1551462255 # MouseBoost
mas install 1592917505 # Noir
mas install 409203825 # Numbers
mas install 1471867429 # OTP Auth
mas install 409201541 # Pages
mas install 600925318 # Parallels Client
mas install 1085114709 # Parallels Desktop
mas install 1472777122 # PayPal Honey
mas install 715483615 # Picture Collage Maker 3 Lite
mas install 1289583905 # Pixelmator Pro
mas install 1571283503 # Redirect Web for Safari
mas install 403195710 # Remote Mouse
mas install 1503136033 # Service Station
mas install 1095562398 # Shopping for Amazon
mas install 442168834 # SiteSucker
mas install 863015334 # Sparkle
mas install 1633701470 # Sticklets
mas install 1150887374 # Sticky Notes
mas install 1082989794 # Templates for Pixelmator
mas install 899247664 # TestFlight
mas install 425424353 # The Unarchiver
mas install 1241342461 # Transcribe
mas install 1450874784 # Transporter
mas install 1482454543 # Twitter
mas install 1211437633 # Universe
mas install 497799835 # Xcode
vscode "ahkohd.glance"
vscode "akvelonprimary.autocomment"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "alexmunteanu.toggle-block-comments"
vscode "andrsdc.base16-themes"
vscode "antfu.browse-lite"
vscode "antfu.vite"
vscode "atishay-jain.all-autocomplete"
vscode "bmalehorn.shell-syntax"
vscode "bmalehorn.vscode-fish"
vscode "bobmagicii.autofoldyeah"
vscode "casperstorm.directory-files"
vscode "chekweitan.compare-view"
vscode "chiro2001.digital-ocean-manager"
vscode "christian-kohler.npm-intellisense"
vscode "codesandbox-io.codesandbox-projects"
vscode "codestream.codestream"
vscode "codezombiech.gitignore"
vscode "coenraads.disableligatures"
vscode "ctf0.macros"
vscode "dae.vscode-mac-color-picker"
vscode "danidandev.comment-remover"
vscode "dart-code.dart-code"
vscode "dawranliou.minimal-theme-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "dhedgecock.radical-vscode"
vscode "dotiful.dotfiles-syntax-highlighting"
vscode "dsoloha.native-macos"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "eg2.vscode-npm-script"
vscode "esbenp.prettier-vscode"
vscode "evolution-gaming.evolution-gaming--vscode-eslint"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hoovercj.vscode-settings-cycler"
vscode "htmlhint.vscode-htmlhint"
vscode "ibm.output-colorizer"
vscode "inu1255.easy-snippet"
vscode "irongeek.vscode-env"
vscode "jabacchetta.vscode-essentials"
vscode "jacobkucera.codepen-theme"
vscode "jakearl.search-editor-apply-changes"
vscode "jasonlhy.hungry-delete"
vscode "jkjustjoshing.vscode-text-pastry"
vscode "jock.svg"
vscode "johnpapa.vscode-peacock"
vscode "jpruliere.env-autocomplete"
vscode "lacroixdavid1.vscode-format-context-menu"
vscode "lakshits11.best-themes-redefined"
vscode "lostintangent.vsls-whiteboard"
vscode "merko.merko-green-theme"
vscode "metaseed.metago"
vscode "metaseed.metajump"
vscode "metaseed.metaword"
vscode "mhutchie.git-graph"
vscode "micnil.vscode-checkpoints"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "moshfeu.diff-merge"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mubaidr.vuejs-extension-pack"
vscode "nerudevs.jellyfish-dark"
vscode "ngryman.codesandbox-theme"
vscode "nhoizey.gremlins"
vscode "peterschmalfeldt.explorer-exclude"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "pranaygp.vscode-css-peek"
vscode "rassek96.vscode-comment-selection"
vscode "redhat.java"
vscode "remimarche.cspell-tech"
vscode "rioj7.vscode-json-validate"
vscode "ritwickdey.liveserver"
vscode "rvest.vs-code-prettier-eslint"
vscode "sankeyteam.dcd"
vscode "sdras.vue-vscode-snippets"
vscode "shayanalijalbani.next-jelly-fish"
vscode "simonsiefke.svg-preview"
vscode "skyapps.fish-vscode"
vscode "slevesque.vscode-multiclip"
vscode "smatdnepr.svg-sprite-viewer-generator"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "svipas.code-autocomplete"
vscode "svipas.control-snippets"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tlevesque2.duplicate-finder"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tomoki1207.pdf"
vscode "trabpukcip.vscode-npm-scripts"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "victoriadrake.kabukicho"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vsls-contrib.gistfs"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.javascriptsnippets"
vscode "xyz.local-history"
vscode "yakenoharashinnosuke.insistent-comments"
vscode "yutengjing.vscode-archive"
vscode "zgm.vscode-fish"
vscode "zignd.html-css-class-completion"
vscode "ziterz.codesandbox-black-theme"
